app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "My Book"], ["description", "A new book by me."], ["created_at", "2021-08-05 00:22:00.807076"], ["updated_at", "2021-08-05 00:22:00.807076"], ["author_id", 6]]
---
  def create
    @post = Post.new(post_params)
    @post.save